from Optim_Lab3.src.Genetic_algorithm import *

genes_number = ["абвгдеёжзийклмнопрстуфхцчшщъыьэюя",
                "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ",
                "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ-.,!:;?«»— ",
                "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТ\
                УФХЦЧШЩЪЫЬЭЮЯabCDEFGHIJKLMNOPQRSTUVWXYZABCDEFGHIJKLMNOPQRSTUVWXYZ "]

words = ["чушь", "ценА", "А, почтеннейший! Вот и вы... в наших  краях...  —  начал \
                        Порфирий, протянув ему обе руки.  —  Ну,  садитесь-ка, батюшка!",
         "Сходил  на интересный blockbuster"]

if __name__ == "__main__":
    print(len(words[3]))
    make_genetic_algorithm(words[3], genes_number[3])

